var roulette;
function start(){
    var result = document.getElementById("result");
    var omikuji = ["エイリアン", "なし", "ゾンビ", "すし","トイレ","コーンポタージュ","きのこ","サラダ","ゴリラ","にわとり","ステーキ","お相撲さん","ハサミ", "ヒーロー","ゲーム","エビ","マヨネーズ","ツナ","おにぎり","金","ドラマ","エンジン","ダイヤモンド","だんご","地球","モノマネ","アルバイト","ネコ","イヌ","きょうりゅう","おべんとう","アルパカ","コアラ","ジェットコースター","口パク","ちょうちょ","ひまわり","あさがお","さくら","リンゴ","バナナ","スイカ","メロン","いちご","レモン","ヒカキン","カレンダー","カラテ","ポテトチップス","ポッキー",
    "トッポ","かきのたね","カキ","マンゴー","ハーゲンダッツ","ガリガリ君","雷","バレンタイン","ホワイトチョコ","チョコ","ネギ","レタス","キャベツ","キュウリ","フォートナイト","クルマ","バイク","テレビ","サッカー","アーチェリー","やきゅう","テニス","かけっこ","ドッジボール","ボーリング","ハシゴ","かいだん","オバケ","ハチ","はちみつ","トウフ","ハト","タカ","ハヤブサ","ゾウ","フラミンゴ","しゃぶしゃぶ","すき焼き","ソフトクリーム","ピストル","スキー","スケート","そり","雪","あられ","たいふう","大雨","キムチ","コンドル","ポイフル",
    "アヒル","ヒヨコ","たけのこの里","きのこの山","チョコパイ","するめ","ドラえもん","スーパーマン","サンマ","サバ","マグロ","ホタテ","アリ","タラコ","イクラ","しめじ","ブドウ","マスカット","むぎ茶","ネコジャラシ","クローバー","フッリスビー","なわとび","ラジオ","ぼうし","マリオ","ルイージ","クッパ","モモ","チャイム","ミッキー","焼肉","焼き鳥","うまいぼう","タコ","イカ","サメ","ショートケーキ","チョコケーキ","パズドラ","モンスト","先生","カタツムリ","カブトムシ","セミ","ラーメン","そば","うどん","スープ","ハンバーグ",
　　　"トマト","トンボ","バレー","レンコン","子ども","マクドナルド","ドーナッツ","ツバメ","めだか","カラス","しゅうまい","くじら","コーラ","ソーダー","カルピス","学校","くま","馬","とけい","アイドル","バス","ヘリコプター","プール","ベット","ボクシング","ビル","なっとう","しょうゆ","はみがき","メガネ","マスク","スクランブルエッグ","わゴム","おせんべい","ミートソース","ポップコーン","ひつじ","七夕","クリスマス","ハロウィン","ヨーグルト","ぼうけん","オラウータン","ゴール","タマネギ","お母さん","カメラ","インタビュー","つらら","ちくわ","スマートフォン",
"遠足","パスタ","ゴミ","ワニ","シャチ","イルカ","朝ごはん","昼ごはん","夜ごはん","くつした","サンタ","ねずみ","ランドセル","かばん","えんぴつ","ロボット","アプリ","いなか","トナカイ","ただ","カギ","チンパンジー","ライオン","ペンギン","トラ","シュークリーム","プリン","ギャグ","ポケモン","そうじき","ホウキ","リモコン","すいとう","まっちゃ","ビール","スピーカー","マシュマロ","マカロン","ざっそう","岩","海","オオカミ","塩水","ケチャップ","ハイチュウ","ホタル","キャンプ","ラジコン","カードゲーム","チョーク","ツル","そうめん"];
    roulette = setInterval(function(){
        var random = Math.round(Math.random() * (omikuji.length - 1));
        result.innerHTML = omikuji[random];
    }, 10);
}

function stop(){
    clearInterval(roulette);
} 
